Revit 2027 API
RebarConstraint.GetTargetHostFaceReferenceForEdgeConstraint Method
 Returns a reference to the host Element face provided at faceIndex, that forms the edge of this RebarConstraint at the specified targetIndex. The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' or 'ToHostEdgeCover'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetTargetHostFaceReferenceForEdgeConstraint(
	int targetIndex,
	int faceIndex
)
Public Function GetTargetHostFaceReferenceForEdgeConstraint (
	targetIndex As Integer,
	faceIndex As Integer
) As Reference
public:
Reference^ GetTargetHostFaceReferenceForEdgeConstraint(
	int targetIndex,
	int faceIndex
)
member GetTargetHostFaceReferenceForEdgeConstraint :
        targetIndex : int *
        faceIndex : int -> Reference
Parameters
targetIndex Int32
 The index of the target. Should be between 0 and NumberOfTargets().
faceIndex Int32
 The face index of the edge. Should be 0 or 1.
Return Value
Reference
 Returns a reference to the host Element face provided at faceIndex, that forms the edge of this RebarConstraint at the specified targetIndex.
Exceptions
Exception | Condition
ArgumentException |  targetIndex is out of range. -or- faceIndex must be 0 or 1.
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToHostEdge' or 'ToHostEdgeCover'.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace